25,465(ssl),587(ssl)

If you want to use it to send mails, and e.g. investigate headers -> check DNS `SPF record` first to see if you're allowed to send mails

#### find MX servers
`dig +short mx google.com`
`+short` - don't show source address and port of the server that provided the answer

#### banner grabbing
- SMTP
`nc -vn 10.10.10.1 25`

- SMTPS
`openssl s_client -crlf -connect smtp.mailgun.org:465 ` SSL/TLS without `starttls` command

`openssl s_client -starttls smtp -crlf -connect smtp.mailgun.org:587`

#### enumeration
`nmap -Pn --script smtp-commands -p25 10.10.10.1`

- RCPT TO
```
telnet 10.10.181.95 25
Trying 10.10.181.95...
Connected to 10.10.181.95.
Escape character is '^]'.
220 polosmtp.home ESMTP Postfix (Ubuntu)
HELO polosmtp.home
250 polosmtp.home
MAIL FROM: test@test.org
250 2.1.0 Ok
RCPT TO:test
550 5.1.1 <test>: Recipient address rejected: User unknown in local recipient table
RCPT TO: administrator
250 2.1.5 Ok
quit
221 2.0.0 Bye
Connection closed by foreign host.
```

- VRFY
```
telnet 10.10.181.95 25
Trying 10.10.181.95...
Connected to 10.10.181.95.
Escape character is '^]'.
220 polosmtp.home ESMTP Postfix (Ubuntu)
helo polosmtp.home
250 polosmtp.home
VRFY root
252 2.0.0 root
VRFY user
550 5.1.1 <user>: Recipient address rejected: User unknown in local recipient table
```

- EXPN
```
telnet 10.10.181.95 25
Trying 10.10.181.95...
Connected to 10.10.181.95.
Escape character is '^]'.
220 polosmtp.home ESMTP Postfix (Ubuntu)
helo polosmtp.home
250 polosmtp.home
EXPN root
502 5.5.2 Error: command not recognized
```

